personality_quiz/app/controllers/api/v1/answers_controller.rb

    def index
        answers = Answer.all
---
SELECT "answers".* FROM "answers"