personality_quiz/app/controllers/api/v1/results_controller.rb

    def show
        result = Result.find(params[:id])
---
SELECT "results".* FROM "results" WHERE "results"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]